[
  "Can you run pgai without docker on windows?",
  "I was wondering for the following information. \n\nDoes the PDF parser also include images? \n\nDoes the embedding take these images into account? \n\nHow to enable this?",
  "how do i add a vectorizer to an existing table",
  "<#1331981876319223879> how to optimize pgvectorscale on a postgres17 timescaledb with a database of 50M+ rows with embeddings of 1024. I already use matryoshka of 512",
  "<#1331981876319223879>  how do i delete a vectorizer",
  "<#1331981876319223879> When using the parsing options like docling do I have the posibility to select the output format after the parsing? Or is the markdown output format by default for everything?",
  "<#1331981876319223879> When using Docling, are the models used to parse documents stored locally in a self-hosted Postgres database?",
  "In pg_ai, is it possible to explicitly provide embedding (eg in unit tests), so it's not automatically generated?",
  "fix: ```2025-06-05 12:48:28 [debug    ]     | docling.exceptions.ConversionError: File format not allowed: uploads/1/AmazonQDev.pdf ``` in worker",
  "ERROR: Could not find a version that satisfies the requirement pgai (from versions: none) How can I solve this error when I install pgai by this command?  pip install pgai",
  "IN my cloudberry environment, postgresql version is 14. How can I install pgvectorscale when requirement is postgresql version 16?",
  "what is your experience in chunking strategies? What are some good working strategies and what strategies work less good?",
  "generate_rag_response\n\nHow to implement this function",
  "I have created a storage bucket for files right now, how to create a well function vectorizer for this",
  "im getting this error: \n\n[42883] ERROR: function ai. openai_embed(text, text, api_key_name => text, dimensions => integer, openai_user => text) does not exist Hint: No function matches the given name and argument types. You might need to add explicit type casts. Where: PL/ pgSQL function ai. vectorizer_embed(jsonb,text,text) line 7 at assignment SQL function \"vectorizer_embed\" statement 1\n\n\nSELECT\n    chunk,\n    embedding <=>  ai.vectorizer_embed(2, 'fraude', 'string') as distance\nFROM risk_embeddings\nORDER BY distance;\n\nFor this",
  "Hi",
  "How does it work with different types of data that I should parse. Lets say I have one huge document table, which can either raw text, a file document (docx, pdf etc), or both. How does the embedding work for that?",
  "How does the pgai s3 integration work?",
  "```\nn8n-db=# SELECT ai.create_vectorizer(\n     'blog'::regclass,\n     loading => ai.loading_column('contents'),\n     embedding => ai.embedding_ollama('nomic-embed-text', 768),\n     destination => ai.destination_table('blog_contents_embeddings')\n);\nERROR:  function ai.loading_column(unknown) does not exist\nLINE 3:      loading => ai.loading_column('contents'),\n                        ^\nHINT:  No function matches the given name and argument types. You might need to add explicit type casts.\n```\nI am getting this error even if the function is there, when i run this query\n`SELECT routine_name, routine_type FROM information_schema.routines WHERE routine_schema = 'ai'`",
  "which version of pgai has the text-to-sql feature included ?",
  "can i use any hugging face model in pgai?",
  "How to calculate size of index in pgvector scale",
  "hello please share the link to download the library pgai vectorizer",
  "Is there a way to use PGAI with Gemini?",
  "Is it normal for pgvectorscale streamingdisk ann to take 3 hours to build the index for 12 million rows with 75 dimensions vector?",
  "Is there a way to vectorize multiple columns of a table? for exampe, concating some columns into a single string.",
  "Hello, is it possible to store chunks in the source table instead of the full documents and disable chunking in the vectorizer configuration?",
  "<@1326487316499529760> Installed pgai, am I able to make responses on endpoint?\n￼",
  "Installed pgai, am I able to make responses on endpoint?",
  "Tell me about yourself <@&1249549447000490075>",
  "How do I create a vectorizer with voyage ai embeddings?",
  "How can I use pgai with sqlalchemy?",
  "Hello World?"
]